# IsValidResourceName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceBrowserData..::..IsValidResourceName Method
ExternalResourceBrowserData Class See Also
---
Checks whether the resource name is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool IsValidResourceName(
	string resourceName
)
```

Visual Basic
---
```text
Public Function IsValidResourceName ( _
	resourceName As String _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidResourceName(
	String^ resourceName
)
```

# ### Parameters
resourceName
    Type: System..::..String The resource name to check.
# ### Return Value
True if the name is a valid resource name, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace